app/views/heroines/edit.html.erb

SELECT "powers".* FROM "powers"
---
  <br>
  <%= f.collection_select :power_id, Power.all, :id, :name %>