app/controllers/heroines_controller.rb

SELECT "heroines".* FROM "heroines"
---
  def index
    # @heroines = Heroine.all
    @heroines = Heroine.search(params[:search])

INSERT INTO "heroines" ("name", "super_name", "created_at", "updated_at", "power_id") VALUES (?, ?, ?, ?, ?)  [["name", "Diana"], ["super_name", "Super Dia"], ["created_at", "2019-05-03 15:53:20.608336"], ["updated_at", "2019-05-03 15:53:20.608336"], ["power_id", 3]]
---
  def create
    @heroine = Heroine.new(heroine_params)

    if @heroine.valid?
      @heroine.save

UPDATE "heroines" SET "super_name" = ?, "updated_at" = ? WHERE "heroines"."id" = ?  [["super_name", "Super Diiiiia"], ["updated_at", "2019-05-03 18:31:22.758519"], ["id", 11]]
---
   def update
     @heroine.update(heroine_params)

DELETE FROM "heroines" WHERE "heroines"."id" = ?  [["id", 11]]
---
   def destroy
     @heroine.delete

SELECT  "heroines".* FROM "heroines" WHERE "heroines"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def find_heroine
    @heroine = Heroine.find(params[:id])